package Teacher.Ch02반복문;

public class Ex {

//	초급 난이도:
//
//		1 1부터 10까지의 숫자를 한 줄에 하나씩 출력하는 프로그램을 작성하세요. (for문 사용)
//
//		2 사용자로부터 양의 정수를 입력받아, 입력한 수의 구구단을 출력하는 프로그램을 작성하세요. (for문 사용)
//
//		3 1부터 100까지의 숫자 중에서 3의 배수인 숫자만 출력하는 프로그램을 작성하세요. (for문 사용)
//
//		중급 난이도:
//
//		4 사용자로부터 정수를 입력받아, 해당 수의 팩토리얼을 계산하여 출력하는 프로그램을 작성하세요. (while문 사용)
//
//		5 1부터 50까지의 숫자 중에서 홀수의 합을 계산하여 출력하는 프로그램을 작성하세요. (while문 사용)
//
//		6 사용자로부터 숫자를 입력받아, 입력한 숫자가 소수인지 판별하는 프로그램을 작성하세요. (while문 사용)
//
//		고급 난이도:
//
//		7 1부터 100까지의 숫자 중에서 3의 배수이거나 5의 배수인 숫자의 합을 계산하여 출력하는 프로그램을 작성하세요. (do-while문 사용)
//
//		8 사용자로부터 양의 정수를 입력받아, 입력한 수의 역순으로 숫자를 출력하는 프로그램을 작성하세요. (do-while문 사용)
//
//		9 사용자로부터 숫자를 입력받아, 입력한 숫자의 약수를 출력하는 프로그램을 작성하세요. (do-while문 사용)
		
		
}
