package C20230629;

public class C20230714 {
//	단위 테스트
//	모듈이나 컴포넌트에 초점을 맞춰 테스트
//
//	통합테스트
//	단위테스트가 완료된 모듈들 결합하여 하나의 시스템으로 완성
//
//	시스템 테스트 
//	개발된 소프트웨어가 완벽하게 수행하는가 점검
//
//	인수 테스트
//	사용자의 요구사항 충족하는지 중점두고 테스트
//
//	물리        데이터 전송 단위 : 비트
//	전송에 필요한 두 장치 간의 접속과 절단등 특성에 대한 규칙 정의
//	장비 : 허브, 리피터
//
//	데이터 링크  데이터 전송 단위 :프레임
//	흐름제어 데이터 동기화
//	장비 : 브릿지, 스위치
//
//	네트워크 	데이터 전송 단위 : 패킷
//	네트워크 연결 관리 및 데이터 교환 및 중계
//	장비 : 라우터
//
//	전송    데이터 전송 단위 :  TCP : Segment , UDP : Datagram
//	인터페이스 담당, 종단 시스템 ,  오류제어,흐름제어
//	장비 : 게이트웨이
//
//	세션    데이터 전송 단위 :  메시지
//	동기 제어, 데이터 교환 관리
//	토큰으로 관리
//
//
//	표현	데이터 전송 단위 : 메시지
//	응용에서 받은 데이터를 세션으로 보내기전에 통신에 적당한 형태로 변환
//	세션에서 받은 데이터는 응용에 맞게 변환
//
//	응용	데이터 전송 단위 : 메시지 
//	사용자가 osi환경에 접근할수잇도록 서비스제공
//
//
//	802.1     osi참조 모델의 관한 규약
//	802.2	 LLC 논리 링크 제어에 관한 규약
//	802.3	 CSMA/CD의 관한 규약
//	802.4	 토큰버스
//	802.5	 토큰 링
//	802.6	 도시형 통신망(man)
//	802.9	 종합 음성/데이터 네트워크
//	802.11	 무선lan의 관한 규약
//
//
//	802.11초기 2.4ghz ofdm 2mbps
//	802.11a     5ghz   54mbps
//	802.11b	  802.11초기 개선안 11mbps
//	802.11e    802.11 부가 기능, qos 기능 지원을 위해 mac계층 수정
//	802.11g    2.4ghz 전파를 쓰지만 802.11a와 동일한 54mbps까지 속도지원
//	802.11n   2.4ghz 대역의 전파, 5ghz 대역의 전파를 사용 최고 600mbps 속도 지원
//
	}
