package Teacher.Ch01분기문;

public class C01_IF {
//	IF문 문제:
//
//	사용자로부터 입력받은 정수가 양수인지, 음수인지, 또는 0인지 판별하는
//	프로그램을 작성해보세요.
//
//	사용자로부터 입력받은 문자가 영어 소문자인지 판별하는 프로그램을 작성해보세요.
//
//	사용자로부터 입력받은 세 개의 정수 중에서 가장 큰 수를 찾아 출력하는
//	프로그램을 작성해보세요.
	
//	IF-ELSE문 문제:
//
//		사용자로부터 입력받은 정수가 짝수인지 홀수인지 판별하는 프로그램을 작성해보세요.
//
//		사용자로부터 입력받은 연도가 윤년인지 판별하는 프로그램을 작성해보세요. (4로 나누어 떨어지는 해는 윤년이지만, 100으로 나누어 떨어지는 해는 윤년이 아니며, 400으로 나누어 떨어지는 해는 윤년입니다.)
//
//		사용자로부터 입력받은 영어 알파벳 소문자에 대해, 자음인지 모음인지 판별하는 프로그램을 작성해보세요.	
		

//	IF-ELSE IF문 문제:
//
//		사용자로부터 입력받은 점수에 대해, 점수의 범위에 따라 학점을 출력하는 프로그램을 작성해보세요. (90 이상은 A, 80 이상은 B, 70 이상은 C, 60 이상은 D, 그 외는 F)
//
//		사용자로부터 입력받은 월에 대해, 해당하는 계절을 출력하는 프로그램을 작성해보세요. (봄: 35월, 여름: 68월, 가을: 911월, 겨울: 12월2월)
//
//		사용자로부터 입력받은 영어 알파벳 소문자에 대해, 자음인지 모음인지 아니면 그 외의 문자인지 판별하는 프로그램을 작성해보세요.	
}
