package Teacher.Ch01분기문;

public class C02Switch {
		
	//[초급]
//		1
//		요일 판별 프로그램:	
//		1부터 7까지의 숫자를 입력받습니다.
//		입력받은 숫자에 따라 해당하는 요일을 출력하는 프로그램을 작성하세요. (1: 월요일, 2: 화요일, ..., 7: 일요일)
//		계산기 프로그램:
//		2	
//		사용자로부터 두 개의 숫자와 연산자(+, -, *, /)를 입력받습니다.
//		입력받은 연산자에 따라서 해당하는 연산을 수행하고 결과를 출력하는 프로그램을 작성하세요. (예: "+": 두 숫자의 합, "-": 두 숫자의 차, "*": 두 숫자의 곱, "/": 두 숫자의 나눗셈)
//		등급 판별 프로그램:
//		3
//		사용자로부터 점수를 입력받습니다. (0부터 100까지의 정수)
//		입력받은 점수에 따라서 등급을 출력하는 프로그램을 작성하세요. (90 이상: A, 80 이상: B, 70 이상: C, 60 이상: D, 그 외: F)
	//[중급]
//		4
//		계절 판별 프로그램 (문자열):
//		사용자로부터 월을 입력받습니다.
//		입력받은 월에 따라 해당하는 계절을 출력하는 프로그램을 작성하세요. (문자열 사용) (35월은 봄, 68월은 여름, 911월은 가을, 12월2월은 겨울로 판단합니다.)
//		직급 인상 프로그램:
//		5	
//		사용자로부터 현재 직급을 입력받습니다. (정수)
//		입력받은 직급에 따라서 인상된 직급을 출력하는 프로그램을 작성하세요. (1: 사원, 2: 대리, 3: 과장, 4: 차장, 5: 부장)
//		날짜 판별 프로그램:
//		6	
//		사용자로부터 월을 입력받습니다. (정수)
//		입력받은 월에 따라 해당 월의 일수를 출력하는 프로그램을 작성하세요. (1월: 31일, 2월: 28일, 3월: 31일, ..., 12월: 31일)
		
	
	//[고급]
//		7
//		사칙연산 계산기:
//		사용자로부터 두 개의 숫자와 연산자(+, -, *, /)를 입력받습니다.
//		SWITCH문을 사용하여 입력받은 연산자에 따라서 해당하는 연산을 수행하고 결과를 출력하는 프로그램을 작성하세요.
//		나눗셈 연산에서는 두 번째 숫자가 0이 아닌 경우에만 계산을 수행하고, 그 외에는 "0으로 나눌 수 없습니다."라는 메시지를 출력합니다.
//		영화 장르 판별 프로그램:
//		8	
//		사용자로부터 영화 장르를 입력받습니다. (액션, 코미디, 드라마, SF, 공포 중 하나)
//		SWITCH문을 사용하여 입력받은 영화 장르에 따라 해당하는 메시지를 출력하는 프로그램을 작성하세요. (액션: "스릴과 전투로 가득한 영화입니다.", 코미디: "웃음이 가득한 영화입니다.", 드라마: "감동적인 영화입니다.", SF: "과학적인 상상력을 자극하는 영화입니다.", 공포: "속삭임과 공포로 가득한 영화입니다.")
//		동물 소리 재생 프로그램:
//		9	
//		사용자로부터 동물의 종류를 입력받습니다. (고양이, 강아지, 소, 말 중 하나)
//		SWITCH문을 사용하여 입력받은 동물에 따라 해당하는 동물의 울음소리를 출력하는 프로그램을 작성하세요. (고양이: "야옹", 강아지: "멍멍", 소: "음메", 말: "히이잉")
	
}
