package 이헌지;

//1.변수(variable)
//중요한 프로그래밍 능력 중의 하나가 바로 '값(data)을 잘 다루는 것'이다. 값을 저장하는 공간인 변수를 잘 이해하고 활용하는것은 그 능력을 얻기 위한 첫걸음이니 단추를 잘 끼워 보자.

//1.1변수(variable)란?
//수학에서 '변수(變數)'를 '변하는 수'라고 정의하지만 프로그래밍언어에서의 변수(variable)란,값을 저장할 수 있는 메모리상의 공간을 의미한다.
//이 공간에 저장된 값은 변경될 수 있기 때문에 '변수'라는 수학용어의 정의와 상통하는 면이 있어서 이렇게 이름 붙여졌다.

//                |"변수란, 단 하나의 값을 저장할 수 있는 메모리 공간."|

//하나의 변수에 단 하나의 값만 저장할 수 있으므로,새로운 값을 저장하면 기존의 값은 사라진다.

//1.2 변수의 선언과 초기화 
//변수를 사용하려면 먼저 변수를 선언해야하는데,변수의 선언방법은 다음과 같다.

//    int age; // age 라는 이름의 변수를 선언 
//    ↙    ↘
//  변수타입 변수이름 

//'변수타입'은 변수에 저장될 값이 어떤 '타입(type)'인지를 지정하는 것이다. 저장하고자 하는 값의 종류에 맞게 변수의 타입을 선택해서 적어주면 된다.
//자바는 정수형, 실수형,문자형 등 다양한 타입을 제공한다.
//'변수이름'은 말 그대로 변수에 붙인 이름이다. 변수는 '값을 저장할 수 있는 메모리 공간' 이므로 변수의 이름은 메모리 공간에 이름을 붙여주는 것이다.
//그래야 그이름을 이용해서 저장공간(변수)에 값을 저장하고,저장된 값을 읽어오기도 할 수 있는 것이다. 당연한 얘기지만 같은 이름의 변수가 여러 개 
//존재해서는 안된다. 서로 구별될 수 있어야하기 때문이다. 변수를 선언하면,메모리의 빈 공간에'변수타입'에 알맞은 크기의 저장공간이 확보되고,
//앞으로 이 저장공간은'변수이름'을 통해 사용할 수 있게 된다.

//위의 문장은 변수'age'를 선언한다. 이 변수는 '나이'를 저장하기 위한 것이고, 나이는 '정수(integer)'이므로 변수의 타입을'int'로 지9정하였다.
//'타입(type)'에 대해서는 곧 자세히 다룰 것이므로 지금은 정수를 저장하려면 변수의 타입을 'int'로 한다는 정도만 알아두자.

//변수의 초기화) 
//변수를 선언한 이후부터는 변수를 사용할 수 있으나,그 전에 반드시 변수를 '초기화(initialization)'해야 한다.
//메모리는 여러 프로그램이 공유하는 자원이므로 전에 다른 프로그램에 의해 저장된'알 수없는 값(쓰레기값,garbage value)'이 남아있을수 있기 때문이다.
//변수에 값을 저장할 때는 대입 연산자'='를 이용한다. 수학에서는 양변의 값이 같다는 뜻이지만, 자바에서는 오른쪽의 값을 왼쪽(변수)에 저장하라는 뜻이다.
//그래서 대입연산자의 왼쪽에서는 반드시 변수가 와야 한다.

//int age = 25; //변수 age를 선언하고 25로 초기화 한다.

//양쪽의 코드는 서로 같은 의미의 다른코드이다.변수는 한 줄에 하나씩 선언하는 것이 보통이지만,타입이 같은 경우 콤마','를 구분자로 여러 변수를 한 줄에 
//선언하기도 한다.

/*  int a;                   
 int b;                  <------>        int a,b;   
 int x = 0;                              int x = 0, y = 0;
 int y = 0;
*/
//변수의 종류에 따라 변수의 초기화를 생략할 수 있는 경두오 있지만,변수는 사용되기전에 적절한 값으로 초기화 ㅎ는 것이 좋다.

//|참고| 지역변수는 사용되기 전에 초기화를 반드시 해야 하지만 클래스 변수와 인스턴스변수는 초기화를 생략할 수있다. 변수의 초기화에 대해서는 6장에서 자세히 배운다.

//"변수의 초기화란,변수를 사용하기 전에 처음으로 값을 저장하는 것"

//지금까지 변수를 선언하고 값을 저장하는 방법을 알아봤으니, 이제 예제를 통해 변수에 저장된 값을 어떻게 읽어오는지 알아보자.
/*class Ch01변수 {
	public static void main (String[] args) {
		int year = 0;
		int age  = 14;
		
		System.out.println(year);
		System.out.println(age);
		
		year = age + 2000;       //변수 age의 값에 2000을 더해서 변수 year에 저장
		age = age + 1;           //변수 age에 저장된 값을 1증가시킨다.
		
		System.out.println(year);             출력값 : 0
		System.out.println(age);                   14
	                                               2014
	                                               15
	}                                              
}
*/
//두 개의 변수age와 year를 선언한 다음,값을 저장하고 출력하는 간단한 예제이다. 
//먼저 변수의 선언부분을 보면, 변수 year와 age를 각각 0과 14로 초기화 하였다.

//int year = 0;  int age = 14;   
//year= 0 age =14

//앞에서 살펴본 것처럼 화면에 글자를 출력하려면 println()을 사용한다.

//System.out.println(year);    : 변수 year의 값을 화면에 출력
//System.out.println(age);     : 변수 age의 값을  화면에 출력

//그 다음의 문장은 변수 age에 저장된 값에 2000을 더한 다음,그 결과를 변수 year에 저장하라는 뜻이다.

//year = age + 2000;

//이 문장이 처리되는 과정을 단계별로 살펴보면 다음과 같다.
/* 
year = age + 2000;
→ year =  14 + 2000;  //변수 age에 저장된 값(14)를 읽어와서 사용 
→ year =  2014;       //변수 year에 2014를 저장한다.
*/
//위의 과정에서 알 수 있듯이 변수에 저장된 값을 사용하려면,그저 변수의 이름만 적어주면 된다. 
//그리고 변수에 값을 저장하는 '대입연산(=)은 우변의모든 계산이 끝난 후에 제일 마지막에 수행된다.
//다음의 코드는 변수 age에 저장된 값을 1증가 시키는데,변수의 값을 읽어다 1을 더한 다음 다시 변수 age에 저장하라는 뜻이다.

//age = age + 1;

//위 문장이 처리되는 과정을 단계별로 살펴보면 다음과 같다.

//age = age + 1;
//→ age = 14 + 1 ;    //변수 age에 저장된 값을 읽어온다.
//→ age = 15;         //변수 age에 15를 저장한다.

//두 변수의 값을 교환하기 
//다음과 같이 변수 x,y가 있을 때,두 변수에 담긴 값을 서로 바꾸려면 어떻게 해야 할까? 잠시 시간을 갖고 생각해보자.
/*
int x = 10;
int y = 20; 
*/
//단순하게 변수 x의 값을 y에 저장하고,y의 값을 x에 저장하면 될 것 같지만 그렇게 해서는 원하는 결과를 얻을 수 없다.

/* 1.변수 y에 저장된 값을 변수 x에 저장
    
x = y;       x=10 y=20
                 ↓
             x=20 y=20
             
2.변수 x에 저장된 값을 변수 y에 저장               

 y = x;      y=20 x=20
                 ↓
             y=20 x=20                   
*/
//첫 번째 단계에서 y의 값을 x에 저장할 때,이미 x의 값이 없어졌기 때문에 x의 값을 y에 저장해도 소용이 없는 것이다.그러면 어떻게 해야 할까?
//다음과 같이 변수를 하나 더 선언해서 x의 값을 임시 저장소로 사용하면 된다.
/* 
     int x = 10;
     int y = 20;
     int tmp;   //값을 임시로 저장할 변수를 선언
*/
//그 다음에 아래와 같은 순서로 값을 옮기면 된다.
/* 
1.변수에 저장된 값을 변수 tmp에 저장

tmp = x;   
          
x=10 y=20                x=10 y=20
↓                 ->      
tmp=???                  tmp=10
 
2.변수 y에 저장된 값을 변수 x에 저장

x = y;  
↓-----------|            x  = 20 y = 20
x = 10 y = 20     ->     tmp = 10
tmp = 10

3.변수 tmp에 저장된 값을 변수 y에 저장

y= tmp;

x = 20 y = 20              x = 20 y = 10
         ↑          ->     
      tmp = 10              tmp = 10
*/
//두 변수의 값을 교환하는 것은 마치 두 컵에 담긴 내용물을 바꾸려면 컵이 하나 더 필요한 것과 같다. 아직도 위의 과정이 잘 이해되지 않는다면,
//한 컵에는 우유를 다른 한 컵에는 물을 담은 다음에 빈 컵을 이용해서 두 컵의 내용물을 바꾸는 일을 직접 해보자.

//예제 2-2 
/*  class Ch01변수{
	   public static void main(String [] args) {
		   int x = 10, y = 20;
		   int tmp = 0;
		   
		   System.out.println("x:"+ x + " y:" + y);	      
		   
		   tmp = x;
		   x = y;                                       // 출력값 
		   y = tmp;                                     // x:10 y:20
		                                                // x:20 y:10
		   System.out.println("x:" + x + "y:"+y );
		   
	   }
}
*/  
//앞서 설명한 내용을 예제로 작성한 것이므로 이해하는데 어려움이 없을 것이다. 한 가지 설명할 것이 있다면 변수의 값을 출력하는 문장인데,
//이 문장이 수행되는 과정을 단계별로 적어보면 다음과 같다.
/*
System.out.println("x:" + x "y:" +y);
System.out.println("x:" + 10 + "y:" + 20);
System.out.println("x:10" + " y:" + 20);
System.out.println("x:10 y:" + 20);
System.out.println("x:10 y:20");
*/
//덧셈연산자'+'는 두값을 더하기도 하지만,이처럼 문자열과 숫자를 하나로 결합하기도 한다. 문자열은 큰따옴표""로 묶은 연속된 문자를 말하는데,
//문자열과 문자열 결합에 대한 자세한 내용은 잠시 후에 다룬다.

//1.3 변수의 명명규칙
//'변수의 이름'처럼 프로그래밍에서 사용하는 모든 이름을 '식별자(identifier)'라고 하며,식별자는 같은 영역 내에서 서로 구분(식별) 될 수 있어야 한다.
//그리고 식별자를 만들 때는 다음과 같은 규칙을 지켜야 한다.

//1.대소문자가 구분되며 길이에 제한이 없다.
//- True와 true는 서로 다른 것으로 간주된다.
//2.예약어를 사용해서는 안 된다.
//- true는 예약어라서 사용할 수 없지만,True는 가능하다.
//3.숫자로 시작해서는 안 된다.
//- top10은 허용하지만,7up은 허용되지 않는다.
//4.특수문자는 '_'와 '$'을 허용한다.
//- $harp은 허용되지만,S#arp은 허용되지 않는다.

//예약어는 키워드(kerword)또는 '리져브드 워드(reserved word)'라고 하는데,프로그래밍언어의 구문에 사용되는 단어를 뜻한다.
//그래서 예약어는 클래스나 변수, 메서드의 이름(identifier)으로 사용할 수 없다.
//아래의 표 2-1은 자바에서 사용되는 예약어이다. 예약어는 앞으로 차차 배워 나가게 될 것이므로 지금은 간단히 흚어보기만 하자.

/* 표) 2-1  java에서 사용되는 예약어

abstract         default       if             package         this
assert           do            goto           private         throw 
boolean          double        implements     protected       throws
byte             else          import         public          transient
break            enum          instanceof     return          true
case             extends       int            short           try
catch            false         interface      static          void
char             final         long           strictfp        volatile
class            finally       natove         super           while
const            float         new            switch
continue         for           null           synchronized
                  
*/ 
//|참고| goto와 const는 실제로 사용되지 않으며,assert는 JDK1.4부터 enum은 JDK1.5부터 새로 추가되었다

//그 외에 필수적인 것은 아니지만 자바 프로그래머들에게 권장하는 규칙들은 다음과 같다.
/*
1.클래스 이름과 첫 글자는 항상 대문자로 한다.
- 변수와 메서드의 이름의 첫 글자는 항상 소문자로 한다.
2.여러 단어로 이루어진 이름은 단어의 첫 글자를 대문자로 한다.
- lastIndexOf,StringBuffer
3.상수의 이름은 모두 대문자로 한다. 여러 단어로 이루어진 경우 '_' 로 구분한다.
- PI,MAX_NUMBER 
*/
//위의 규칙들은 반드시 지켜야 하는 것은 아니지만,코드를 보다 이해하기 쉽게 하기 위한 자바 개발자들 사이의 암묵적인 약속이다.
//이 규칙을 따르지 않는다고 해서 문제가 되는 것은 아니지만 가능하면 지키도록 하자.
//만일 특별한 방식으로 식별자를 작성해야 한다면 미리 규칙(coding convention)을 정해놓고 프로그램 전체에 일관되게 적용하는 것이 필요하다.

//|참고| 자바에서는 모든 이름에 유니코드에 포함된 문자들을 사용할 수 있지만,적어도 클래스이름은 ASCII코드(영문자)로 하는 것이 좋다.
//유니코드를 인식하지 못하는 운영체제(OS)도 있기 때문이다.

//변수의 이름은 짦을수록 좋지만,약간 길더라도 용도를 알기 쉽게'의미있는 이름'으로 하는 것이 바람직하다.
//변수의 선언문에 주석으로 변수에 대한 정보를 주는 것도 좋은 생각이다.

//int curPos  = 0;       //현재위치(current position)
//int lastPos = -1;      //마지막 위치(last position)



